tutorials/FF/dambreak/of-of_supercritical/IF_Right/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant IF_Right;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              IF_Right-Mesh;
    patches           (leftWall_inlet);

    readData
    (
      Velocity
      Alpha
      PrghGradient
    );

    writeData
    (
        Prgh
    );
  };
};
