tutorials/FF/dambreak/of-of_supercritical/IF_Right/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

xleft 10;
xmiddle 15;
xright 20;

ybottom 0;
ymiddle 5;
ytop 10;

zback 0;
zmiddle 5;
zfront 10;

rad 5;

regions
(
    boxToCell
    {
        box ($xleft $ybottom $zback) ($xright $ymiddle $zfront);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
);


// ************************************************************************* //
